
"use strict";


let data = [
    {
        id:1,
        title: "Приложение Mir Pay удалили из Google Play. Рассказываем, где его теперь можно скачать",

        description:[
          "Вслед за новостью о прекращении работы Samsung Pay с картами «Мир» стало известно и об исчезновении официального приложения платёжной системы Mir Pay из магазина Google Play.",
          "Mir Pay служит для оплаты смартфоном с модулем NFC покупок через терминалы с поддержкой бесконтактных карт «Мир», а также в онлайн-магазинах при наличии опции «Оплатить Mir Pay». Предполагается, что исчезновение приложения из Google Play стало результатом введения санкций в отношении Национальной системы платёжных карт (НСПК). Вместе с Mir Pay из магазина пропали также приложения «СБПэй» и «Привет!».",
          "Владельцы Android-смартфонов с версией системы 7.0 и выше по-прежнему могут скачать приложение Mir Pay с нашего форума, а также в магазинах RuStore и App Gallery",
        ],

        images:[
          "https://4pda.to/s/as6yrz2uYRxsOfJRHv4JKX4jId7iVfb4vPx63knRxMJvT.jpg?v=1711531384",
          "https://4pda.to/s/as6yunvhERcJY14cpA69maDshRPC4D.jpg",
          
        ],
      
    },
    {
        id:2,
        title:"Samsung Pay перестаёт работать с карточками «Мир»",

        description: [
          "С 2022 года российские владельцы смартфонов Samsung могли использовать сервис Samsung Pay для бесконтактной оплаты покупок с помощью банковских карт «Мир», но уже в скором времени такой возможности у них больше не будет. Об этом официально заявила сама компания.",
          "На сайте Samsung появилось следующее сообщение: Уважаемые пользователи,Начиная с 3 апреля 2024 года добавление и использование карт «Мир» в Samsung Pay будет недоступно.",
          "При этом функционал добавления и использования клубных карт/карт постоянного клиента в приложении Samsung Pay будет работать без изменений. ",
          "Таким образом, владельцам смартфонов Samsung в России стоит заранее скачать альтернативные сервисы для оплаты покупок, например, Mir Pay.",

         
        ],
        images:[
          "https://4pda.to/s/as6yvd44axM8X7v4ud5pz0IAEHGere6oE7Ohm.jpg?v=1711530345",
          "https://4pda.to/s/as6yuz0ntuioHd8J2fJPveOBP3VJz0Vt.jpg",
      
        ],
    },
    {
      id:3,
      title:"Умное кольцо Apple позаимствует одну из функций гарнитуры Vision Pro",

      description:[
        "В сети появилась патентная документация, раскрывающая любопытные подробности об умном кольце Apple. Она содержит серию изображений, демонстрирующих одну из особенностей гаджета — функцию распознавания жестов, работа которой напоминает схему управления гарнитурой Vision Pro.",
        "Судя по патентным эскизам, Apple Smart Ring сможет распознавать касания к другим частям тела пользователя и устанавливать сопряжение со вторым таким же кольцом, надетым на другой палец. На изображениях показан широкий набор жестов.",
        "Кроме того, патент намекает на возможность взаимодействия умного кольца с другими продуктами Apple. В частности, на некоторых картинках изображены смарт-часы, управлять которыми пользователь сможет, рисуя определённые линии и фигуры на ладони другой руки.",
        "Возможная дата анонса устройства по-прежнему неизвестна.",
      ],
      images:[
        "https://4pda.to/s/as6yrVeWSshjO81eMC7sq5UK8leLuks4y29RItK3wT2t.jpg?v=1711529366",
        "https://4pda.to/s/as6yujX54gTPJwEN80N22PelqBHO6e.jpg",
        "https://4pda.to/s/as6yuffHcz2SQLrMhkz2tIAjQo1wgIN3.jpg",
        
      ],
    },
    {
      id:4,
      title:"Мощную уличную колонку Xiaomi Camp с защитой от воды оценили в $96",

      description:["Каталог техники Xiaomi SU7 пополнила Bluetooth-колонка Camp, ориентированная на уличное использование. Новинка может похвастать мощным 360-градусным звуком с настройкой Harman Kardon, поддерживает функцию эквалайзера и долго работает на одном заряде аккумулятора.",
      "Акустическая система Xiaomi Camp общей мощностью 40 Вт включает по два высоко- и низкочастотных драйвера, а также пару пассивных излучателей для усиления басов. Заявленной время автономной работы колонки составляет до 14 часов в зависимости от громкости воспроизведения. Для подключения к смартфону используются модули Bluetooth 5.3 и NFC.",
      "Новинка «упакована» в металлический корпус, защищённый от пыли и воды по стандарту IP66, на верхней панели предусмотрены кожаный ремешок для переноски устройства и сенсорные кнопки управления. Снизу есть встроенная подсветка, а также мощные магниты для установки колонки на металлических поверхностях.",
    ],
      images:["https://4pda.to/s/as6yv3CmMc3fo9Yz1H0P5A6eRGJEA8MwwLrcj.jpg?v=1711694405",
"https://4pda.to/s/as6yuz0XLWsBz1FifBUdBK5LMiIqnez14.jpg",
"https://4pda.to/s/as6yu5HDy0ygDfWSwz0IBrDggz0SrYFV.jpg",
    ],
    },
    {
id:5,
title:"IM Motors анонсировала первый в мире серийный электрокар с твердотельной АКБ",
description:["новые подробности об электрокаре IM L6, который компания IM Motors позиционирует как первый в отрасли автомобиль, оснащённый твердотельной АКБ",
"По данным портала Carnewschina, ёмкость аккумулятора транспортного средства составит 130 кВтч. Его конструкция состоит из катода, покрытого материалом со сверхвысоким содержанием никеля, и анода, который представляет собой новое поколение композитного кремний-углеродного материала с высокой удельной энергией.",
"Основное отличие твердотельных АКБ от традиционных состоит в использовании твёрдого электролита, а в случае с аккумулятором IM L6 — запатентованного наноразмерного электролита собственной разработки. Он, по заверению вендора, обладает высокой ионной проводимостью и устойчивостью к высоким температурам, что предположительно сокращает риск возгорания.",
],
images:["https://4pda.to/s/as6yz1CKCmP39YX6aelHnOBrkXeaBBGLIxEtOKOSt80Ns.jpg?v=1711692808",
"https://4pda.to/s/as6yu51ji8e8OeZQrbkjAjwY9keNz1a.jpg",
"https://4pda.to/s/as6yuz0nrmz1VSQjgDHz2towr6ac6iTFz2.jpg",
],
    },
    {
      id:6,
      title:"Представлен Honor Play 50: процессор Dimensity, экран 90 Гц и цена $165",
      description:["Компания Honor выпустила сразу два недорогих смартфона — Honor 50 Play и Honor 50m. Они получили одинаковые характеристики, но их цена значительно",
    "Honor 50 Play оснащён 6,56-дюймовым IPS-дисплеем с разрешением 1612x720 пикселей и частотой обновления 90 Гц. Аппаратная платформа новинки включает процессор MediaTek Dimensity 6100+, 6/8 ГБ оперативной и 128/256 ГБ встроенной памяти, а работает смартфон под управлением Android 14 с оболочкой MagicOS 8.0.Разрешение основной камеры составляет 13 Мп, фронтальной — 5 Мп. За автономность гаджета отвечает аккумулятор ёмкостью 5200 мАчHonor 50m получил аналогичные характеристики. Различие только в расцветках: Honor 50 Play предлагается в чёрном, розовом и зелёном корпусах, а 50m — в чёрном и светло-зелёном.",
    "Honor Play 50 в модификации 6/128 ГБ продаётся в Китае за $165, версия 8/256 ГБ оценена в $194. Honor 50m в тех же конфигурациях памяти стоит $207 и $262 соответственно. По информации инсайдера WhyLab, разница в цене может быть связана с тем, что новинки будут распространяться по разным каналам продаж.",
    ],
      images:["https://4pda.to/s/as6yz2z2opmvJ1sZZTdNTFxz0YARXpF1XkOALDH3SsMREiy.jpg?v=1711678326",
    "https://4pda.to/s/as6yurXSvEdGaESQr5UrMxTUFXmhOR.jpg",
    "https://4pda.to/s/as6yu51iXIHdmCPJYX4i9B5Y9EOlIg.jpg",
    ],
    },
    {
    id:7,
    title:"Вышла спецверсия Red Magic 9 Pro+ в духе «Трансформеров»",
    description:["Бренд Nubia представил лимитированную версию смартфона Red Magic 9 Pro+ под названием Bumblebee Transformers Edition",
  "В коробке, помимо самого смартфона, покупатели найдут фирменный кулер, специальное зарядное устройство мощностью 165 Вт (GaN), оригинальную скрепку для извлечения SIM-карты, USB-кабель, защитный чехол Magnetic eSports и значок. Кроме того, соответствующую стилизацию получил интерфейс прошивки.Red Magic 9 Pro+ Bumblebee Transformers Edition «упакован» в корпус ярко-жёлтого цвета с чёрными вставками из углеродного волокна. На тыльную панель нанесено имя знаменитого автобота в окружении прочих декоративных элементов.",
  "По части характеристик по сравнению с базовой моделью ничего не изменилось. Смартфон оснащён 6,8-дюймовым OLED-экраном с разрешением 1,5K, частотой обновления 120 Гц и пиковой яркостью 1600 нит. За его производительность всё так же отвечает процессор Snapdragon 8 Gen 3, но конфигурация памяти всего одна — 16/512 ГБ. В состав тыльной камеры входят основной 50-мегапиксельный датчик с OIS, сверхширокоугольный на 50 Мп и макромодуль с разрешением 2 Мп.",
  ],
    images:["https://4pda.to/s/as6yz0l06Xo1ixU6a8VfTs07pKPz2Hoz2Tc9ponpaweuuxu.jpg?v=1711706712",
  "https://4pda.to/s/as6yunf8L7Gas31l4Uay1z2tz2yz2Zb31.jpg",
  "https://4pda.to/s/as6yuz0nqpuG4cBLDHV7gcZXOW9qXf0.jpg",
  ],
    },
    {
        id:8,
        title:"Новая версия iOS удвоила мощность беспроводной зарядки iPhone",
        description:["С самого момента релиза от беспроводных зарядок сторонних брендов iPhone 12 получал вдвое меньше мощности, чем от оригинального аксессуара MagSafe. Наконец",
      "После апдейта в iPhone 12 автоматически «включается» поддержка беспроводных зарядок стандарта Qi2 с возможностью приёма 15 Вт входной мощности вместо 7,5 Вт. Стандарт предусматривает использование магнитов для центрирования индукционных катушек по аналогии с MagSafe.По мнению портала GSMArena, сходство Qi2 с MagSafe может быть вызвано тем, что Apple — руководящий член Консорциума Wireless Power Consortium (WPC), который утверждает стандарты зарядки. Ранее WPC опубликовала спецификации нового стандарта.",
      ],
        images:["https://4pda.to/s/as6yyi69vEdJxUcKG3z2wA68hez20Hoz2z0MHFKkZikAjvuz1.jpg?v=1711703776",
      "https://4pda.to/s/as6yujHaxioHd8J29ZXL6pfiIK1GIA.jpg",
      ],
        },
        {
            id:9,
            title:"А что там с «Ведьмаком»? Главное из свежего отчёта CD Projekt",
            description:["Осенью прошлого года CD Projekt наконец-то покончила с Cyberpunk 2077 — компания выпустила сюжетное DLC Phantom Liberty и ряд крупных патчей, после чего отправилась заниматься следующими большими проектами. Судя по свежей информации, их придётся подождать",
          "Общая выручка от продаж Cyberpunk 2077 и Phantom Liberty превысила три миллиарда злотых (более 750 миллионов долларов), из которых 826 миллиона пришлись на 2023 год.Следующий «Ведьмак» (известный как Polaris) находится на этапе препродакшена; ответственная за проект команда продолжается увеличиваться и в данный момент насчитывает 403 человекаРемейк оригинальной The Witcher, которым занимается студия Fool’s Theory, сиквел Cyberpunk 2077 (кодовое название — Orion) и игра по абсолютно новому IP (Hadar) находятся на стадии проработки концепции.Активное производство игры The Molasses Flood во вселенной «Ведьмака» ещё не стартовало.Выручка CD Projekt от продаж в 2023 году превысила 1,2 миллиарда злотых ($308 миллионов), а прибыль — 481 миллион злотых ($120 миллионов); эти показатели выше показателей позапрошлого года на 29% и 39% соответственно.В дальнейшем CDPR намерена лицензировать свои бренды сторонним компаниям, чтобы те делали мобильные игры по мотивам их IP",
         "В целом 2023 год стал вторым самым успешным годом в истории CD Projekt. Вот что бывает, если провести грамотную работу над ошибками.",
          ],
            images:["https://4pda.to/s/as6yvdKaqp2gq6w2tz2vL2oQ6bYr0Pz0uViQE9.jpg?v=1711707325",
            "https://4pda.to/s/as6yu5HCz26ponFVSwTYJfRDMxJjUfW.png",
          ],
            },
            {
                id:10,
                title:"Инсайдер назвал дату анонса флагманского HUAWEI P70",
                description:["В китайской соцсети Weibo появилась неофициальное изображение с предположительной датой премьеры флагманской серии смартфонов HUAWEI P70. Кроме того, инсайдеры опубликовали подробный список ожидаемых технических характеристик всех устройств фирменной серии",
              "По имеющимся сведениям, на презентации, запланированной на 2 апреля, компания покажет четыре смартфона: HUAWEI P70, P70 Pro, P70 Pro+ и P70 Art. Если верить опубликованной информации, их спецификации будут следующими:",
              ],
                images:["https://4pda.to/s/as6yx76Xz0acmjvQoFJNUGz2d3irHQWIGR6Rjz2.jpg?v=1711702445",
              "https://4pda.to/s/as6yuffHgdWygrsxchL7BECLTiDEXK.jpg",
              ],
                },
                {
                    id:11,
                    title:"Xiaomi запустила новый бренд одежды и аксессуаров",
                    description:["Вслед за объявлением старта продаж электрокара SU7 компания Xiaomi сообщила о создании нового бренда Xiaomi Life. На соответствующем сайте уже появился перечень стартовой продукции новой торговой марки: это одежда и различные аксессуары, ориентированные как на автовладельцев, так и на пешеходов",
                  "Стартовый ассортимент Xiaomi Life включает различные футболки ($13), рубашки ($27,5), шапки ($13) и бейсболки ($18), а также сумки, шопперы ($ 6,8) рюкзаки ($83) и кружки (от $9,5). В дальнейшем бренд намерен расширить фирменную коллекцию одежды и аксессуаров.",
                  "От обычной продукции Xiaomi новинки отличает чёрно-белый логотип компании с приставкой life. Сейчас приобрести такие товары можно только в Китае — о расширении географии продаж компания ещё не объявляла.",
                  ],
                    images:["https://4pda.to/s/as6yqOsPnQ56wTWR8z2P5gM0VQYrW9riz0PhrZ.jpg?v=1711702510",
                  "https://4pda.to/s/as6yuz01L0c3gjve8OeJeZgsyQ03rBr.jpg",
                  ],
                    },
                    {
                        id:12,
                        title:"Аналитики: SSD и накопители для смартфонов скоро заметно подорожают",
                        description:["Аналитическая компания TrendForce выпустила отчёт о грядущих изменениях на рынке флеш-памяти NAND. По словам экспертов, контрактные цены такой продукции уже в ближайшее время вырастут, что приведёт к подорожанию твердотельных накопителей и модулей памяти для мобильных устройств.",
                      "По данным TrendForce, объём закупок чипов NAND во втором квартале 2024 года окажется ниже в сравнении с первым кварталом, в том числе из-за повышения цен на 13-18%. Как следствие, снизится и уровень складских запасов у поставщиков.Согласно прогнозу, ко второму кварталу увеличится стоимость памяти eMMC (на 15%) и UFS (на 10-15%). Что касается твердотельных накопителей корпоративного класса и решений для ЦОД, то контрактные цены такой электроники, как ожидается, подскочат на 20-25%. Упоминаются в отчёте и потребительские SSD, которые предположительно подорожают на 10-15%.",
                      "Официальных заявлений о повышении цен на свою продукцию производители SSD и модулей памяти пока не делали.",
                      ],
                        images:["https://4pda.to/s/as6yrRmMfcZvwT0hGZFYMGF7c4AW9rCDBMBUR0WndeJS.jpg?v=1711702489",
                      "https://4pda.to/s/as6yub1Cz26ponFVSwTYJfRDMxJjUfW.jpg",
                      "https://4pda.to/s/as6yu1vPz15rz0fpvZQDgdR6ud0Pyrh5.jpg",
                      ],
                        },
    
]

let show = document.querySelector(".show")
let close = document.querySelector(".close")
let container = document.querySelector(".container")

let title_popup = document.querySelector(".title_popup")
let one_photo = document.querySelector(".one_photo")
let two_photo = document.querySelector(".two_photo")
let three_photo = document.querySelector(".three_photo")
let desc_one = document.querySelector(".desc_one")
let desc_two = document.querySelector(".desc_two")
let desc_three = document.querySelector(".desc_three")
let popup = document.querySelector(".popup")


close.addEventListener('click', () => {
    container.style.transform = "translateY(-140%)"
})


let wrapper = document.querySelector('.wrapper')

function createCard(){
    data.map(item =>
      {
        let card = document.createElement("div")
        card.classList.add('card')
        let title = document.createElement("h2")
       title.innerHTML = item.title
       let desc = document.createElement('p')
       desc.innerHTML = item.description[0]
       let img = document.createElement('img')
       img.setAttribute('src', item.images[0])

       card.append(title)
       card.append(desc)
       card.append(img)

       wrapper.append(card)



       
       card.addEventListener('click',() => {

        container.style.transform = "translateY(0%)"
        
       
             title_popup.innerHTML = item.title
          
            desc_one.innerHTML = item.description[0]
            desc_two.innerHTML = item.description[1]
            desc_three.innerHTML = item.description[2]
           
            one_photo.setAttribute('src', item.images[0])
            two_photo.setAttribute('src', item.images[1])
            three_photo.setAttribute('src', item.images[2])
          

         
           
          
         
           
           

           
    })
      })      
}

createCard()






















